Repository: Pratibha65/QuizzSpark
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: es, fr, hi

source: The shortest path from curious to genius
es: El camino más corto de la curiosidad al genio
fr: Le chemin le plus court pour passer de la curiosité au génie
hi: जिज्ञासु से प्रतिभाशाली बनने का सबसे छोटा रास्ता

source: It all starts with a single word. What are you curious about?
es: Todo empieza con una sola palabra. ¿Qué te interesa?
fr: Tout commence par un simple mot. Qu'est-ce qui vous intrigue ?
hi: यह सब एक शब्द से शुरू होता है। आप किस बारे में उत्सुक हैं?

source: Enter a topic...
es: Introduce un tema...
fr: Saisissez un sujet…
hi: कोई विषय दर्ज करें...

source: e.g., The Roman Empire, Quantum Physics, Indian History...
es: p. ej., El Imperio Romano, Física Cuántica, Historia de la India...
fr: Ex. : L'Empire romain, la physique quantique, l'histoire de l'Inde…
hi: जैसे, रोमन साम्राज्य, क्वांटम भौतिकी, भारतीय इतिहास...

source: Science
es: Ciencia
fr: Sciences
hi: विज्ञान

source: History
es: Historia
fr: Histoire
hi: इतिहास

source: 🇮🇳 Indian Premier League
es: 🇮🇳 Liga Premier India
fr: 🇮🇳 Ligue 1 indienne
hi: 🇮🇳 इंडियन प्रीमियर लीग

source: Surprise Me! ✨
es: ¡Sorpréndeme! ✨
fr: Surprenez-moi ! ✨
hi: मुझे चौंका दो! ✨

source: Difficulty
es: Dificultad
fr: Difficulté
hi: कठिनाई का स्तर

source: Easy
es: Fácil
fr: Facile
hi: आसान

source: Medium
es: Medio
fr: Moyen
hi: मध्यम

source: Hard
es: Difícil
fr: Difficile
hi: कठिन

source: Questions
es: Preguntas
hi: प्रश्न

source: Why Choose Us?
es: ¿Por qué elegirnos?
fr: Pourquoi nous choisir ?
hi: हमें क्यों चुनें?

source: 🧠 Limitless Topics
es: 🧠 Temas ilimitados
fr: 🧠 Sujets illimités
hi: 🧠 असीमित विषय

source: Never take the same quiz twice. <strong>Create a study quiz from notes</strong> on astrophysics or <strong>make a trivia quiz for fun</strong> about 18th-century art. Our engine helps you <strong>create your own quiz</strong> on any topic imaginable.
es: Nunca hagas el mismo test dos veces. <strong>Crea un test de estudio con tus apuntes</strong> sobre astrofísica o <strong>crea un test de trivia para divertirte</strong> sobre el arte del siglo XVIII. Nuestro motor te ayuda a <strong>crear tu propio test</strong> sobre cualquier tema imaginable.
fr: Ne faites plus jamais le même quiz. <strong>Créez un quiz d'étude à partir de vos notes</strong> sur l'astrophysique ou <strong>un quiz ludique</strong> sur l'art du XVIIIe siècle. Notre moteur vous aide à <strong>créer votre propre quiz</strong> sur tous les sujets imaginables.
hi: एक ही क्विज़ को दोबारा न दें। <strog>नोट्स से एक अध्ययन क्विज़ बनाएँ</strong> खगोल भौतिकी पर या <strong>मज़े के लिए एक सामान्य ज्ञान क्विज़ बनाएँ</strong> 18वीं सदी की कला के बारे में। हमारा इंजन आपको <strong>अपनी क्विज़ बनाने में मदद करता है</strong> किसी भी कल्पनीय विषय पर।

source: 🧗 Your Perfect Challenge
es: 🧗 Tu desafío perfecto
fr: 🧗 Votre défi idéal
hi: 🧗 आपकी आदर्श चुनौती

source: Just starting out or ready for the final boss? Choose your difficulty and test your knowledge at the right level for you.
es: ¿Empiezas o estás listo para el desafío final? Elige tu dificultad y pon a prueba tus conocimientos en el nivel adecuado para ti.
fr: Vous débutez ou êtes prêt pour le boss final ? Choisissez votre niveau de difficulté et testez vos connaissances au niveau qui vous convient.
hi: क्या आप अभी शुरुआत कर रहे हैं या अंतिम चुनौती के लिए तैयार हैं? अपनी कठिनाई चुनें और अपने ज्ञान को अपने लिए सही स्तर पर परखें।

source: 📤 Share Results
es: 📤 Compartir resultados
fr: 📤 Partager les résultats
hi: 📤 परिणाम साझा करें

source: Aced that tough quiz? Share your score card with a single click and challenge your friends to beat you.
es: ¿Superaste ese cuestionario difícil? Comparte tu puntuación con un solo clic y reta a tus amigos a que te ganen.
fr: Vous avez réussi ce quiz difficile ? Partagez votre score en un seul clic et défiez vos amis.
hi: क्या आपने उस कठिन क्विज़ में सफलता प्राप्त की? एक क्लिक से अपना स्कोर कार्ड साझा करें और अपने दोस्तों को आपको हराने की चुनौती दें।

source: 🚀 Instant Access, Completely Free
es: 🚀 Acceso instantáneo, completamente gratis
fr: 🚀 Accès instantané, entièrement gratuit
hi: 🚀 तुरंत पहुँच, पूरी तरह मुफ़्त

source: Jump straight into creating. No accounts, no sign-ups, no credit cards required. Your next quiz is just one click away.
es: Empieza a crear directamente. Sin cuentas, sin registros, sin tarjetas de crédito. Tu próximo cuestionario está a solo un clic.
fr: Lancez-vous directement dans la création. Pas besoin de créer de compte, d'inscription ou de carte bancaire. Votre prochain quiz est à portée de clic.
hi: सीधे क्विज़ बनाना शुरू करें। कोई खाता नहीं, कोई साइन-अप नहीं, कोई क्रेडिट कार्ड की आवश्यकता नहीं। आपकी अगली क्विज़ बस एक क्लिक दूर है।

source: Ready for Another Challenge?
es: ¿Listo para otro desafío?
fr: Prêt pour un nouveau défi ?
hi: एक और चुनौती के लिए तैयार हैं?

source: The learning never stops. Pick your next topic below.
es: El aprendizaje nunca se detiene. Elige tu próximo tema a continuación.
fr: L’apprentissage est permanent. Choisissez votre prochain sujet ci-dessous.
hi: सीखना कभी बंद नहीं होता। नीचे अपना अगला विषय चुनें।

source: Topic
es: Tema
fr: Sujet
hi: विषय

source: Difficulty level
es: Nivel de dificultad
fr: Niveau de difficulté
hi: कठिनाई का स्तर

source: Number of Questions
es: Número de preguntas
fr: Nombre de questions
hi: प्रश्नों की संख्या

source: Spark the Quiz!?
es: ¡Despierta el cuestionario!
fr: Lancez le quiz !
hi: क्विज़ शुरू करें!?

source: Building your challenge...
es: Creando tu desafío...
fr: Construisez votre défi…
hi: अपनी चुनौती तैयार करें...

source: Your Instant AI Quiz Generator
es: Tu generador instantáneo de cuestionarios de IA
fr: Votre générateur de quiz instantané basé sur l'IA
hi: आपका इंस्टेंट AI क्विज़ जेनरेटर

source: QuizzSpark is a free online test creator designed for students, teachers, and curious minds in India and across the world. We believe that creating a custom quiz should be simple and instant. Here’s how our quiz maker brings any topic to life in under a minute:
es: QuizzSpark es un creador de tests online gratuito, diseñado para estudiantes, profesores y mentes curiosas de la India y del mundo. Creemos que crear un test personalizado debe ser sencillo e instantáneo. Así es como nuestro creador de tests da vida a cualquier tema en menos de un minuto:
fr: QuizzSpark est un créateur de tests en ligne gratuit conçu pour les étudiants, les enseignants et les curieux en Inde et dans le monde entier. Nous pensons que créer un quiz personnalisé doit être simple et instantané. Voici comment notre créateur de quiz donne vie à n'importe quel sujet en moins d'une minute :
hi: क्विज़स्पार्क एक मुफ़्त ऑनलाइन टेस्ट क्रिएटर है जिसे भारत और दुनिया भर के छात्रों, शिक्षकों और जिज्ञासु लोगों के लिए डिज़ाइन किया गया है। हमारा मानना ​​है कि एक कस्टम क्विज़ बनाना आसान और तुरंत होना चाहिए। हमारा क्विज़ मेकर किसी भी विषय को एक मिनट से भी कम समय में जीवंत बना देता है:

source: 1. Enter Any Topic
es: 1. Introduce un tema...
fr: Saisissez un sujet…
hi: कोई विषय दर्ज करें...

source: Simply type any subject into the box – from the IPL to quantum physics. Our AI is ready to generate a quiz on any topic you can imagine.
es: Simplemente escribe cualquier tema en el recuadro, desde el IPL hasta la física cuántica. Nuestra IA está lista para generar un cuestionario sobre cualquier tema que imagines.
fr: Saisissez simplement le sujet de votre choix dans le champ, de l'IPL à la physique quantique. Notre IA est prête à générer un quiz sur tous les sujets imaginables.
hi: बस बॉक्स में कोई भी विषय टाइप करें - आईपीएल से लेकर क्वांटम भौतिकी तक। हमारा AI आपके द्वारा कल्पना किए जा सकने वाले किसी भी विषय पर क्विज़ बनाने के लिए तैयार है।

source: 2. Customize Your Test
es: 2. Personaliza tu prueba
fr: 2. Personnalisez votre test
hi: 2. अपनी परीक्षा को अनुकूलित करें

source: Choose your desired difficulty and the number of multiple-choice questions. It’s the perfect custom quiz maker for any study session or classroom activity.
es: Elige el nivel de dificultad deseado y el número de preguntas de opción múltiple. Es el creador de cuestionarios personalizados perfecto para cualquier sesión de estudio o actividad en el aula.
fr: Choisissez le niveau de difficulté souhaité et le nombre de questions à choix multiples. C'est le créateur de quiz personnalisé idéal pour vos séances d'étude ou vos activités en classe.
hi: अपनी इच्छित कठिनाई और बहुविकल्पीय प्रश्नों की संख्या चुनें। यह किसी भी अध्ययन सत्र या कक्षा गतिविधि के लिए एकदम सही कस्टम क्विज़ निर्माता है।

source: 3. Spark Your Quiz!
es: ¡Despierta el cuestionario!
fr: Lancez le quiz !
hi: क्विज़ शुरू करें!?

source: Click the button to instantly receive your unique quiz. Challenge yourself, share with friends, or use it to prepare for an exam. It’s that easy!
es: Haz clic en el botón para recibir al instante tu cuestionario único. Ponte a prueba, compártelo con tus amigos o úsalo para prepararte para un examen. ¡Así de fácil!
fr: Cliquez sur le bouton pour recevoir instantanément votre quiz personnalisé. Mettez-vous au défi, partagez-le avec vos amis ou utilisez-le pour vous préparer à un examen. C'est aussi simple que ça !
hi: अपनी अनूठी क्विज़ तुरंत प्राप्त करने के लिए बटन पर क्लिक करें। खुद को चुनौती दें, दोस्तों के साथ साझा करें, या परीक्षा की तैयारी के लिए इसका उपयोग करें। यह इतना आसान है!

source: Frequently Asked Questions
es: Preguntas frecuentes
fr: Foire aux questions
hi: अक्सर पूछे जाने वाले प्रश्न

source: Is this AI quiz generator truly free to use?
es: ¿Es este generador de cuestionarios de IA realmente gratuito?
fr: Ce générateur de quiz IA est-il vraiment gratuit ?
hi: क्या यह AI क्विज़ जनरेटर वास्तव में उपयोग करने के लिए मुफ़्त है?

source: Yes, 100%%! QuizzSpark is a completely free quiz maker. There are no hidden costs, no premium versions, and no limits on how many quizzes you can create.
es: ¡Sí, totalmente gratuito! QuizzSpark es un creador de cuestionarios completamente gratuito. Sin costes ocultos, sin versiones premium y sin límite en la cantidad de cuestionarios que puedes crear.
fr: Oui, 100 %% ! QuizzSpark est un créateur de quiz entièrement gratuit. Il n'y a aucun coût caché, aucune version premium et aucune limite au nombre de quiz que vous pouvez créer.
hi: हाँ, 100%%! QuizzSpark एक पूरी तरह से मुफ़्त क्विज़ निर्माता है। इसमें कोई छिपी हुई लागत नहीं है, कोई प्रीमियम संस्करण नहीं है, और आप कितने भी क्विज़ बना सकते हैं, इसकी कोई सीमा नहीं है।

source: Do I need to create an account or sign up?
es: ¿Necesito crear una cuenta o registrarme?
fr: Dois-je créer un compte ou m'inscrire ?
hi: क्या मुझे खाता बनाने या साइन अप करने की आवश्यकता है?

source: No. We believe in instant access. You can start creating your quiz the moment you land on our page, with no sign-up required.
es: No. Creemos en el acceso instantáneo. Puedes empezar a crear tu cuestionario en cuanto llegues a nuestra página, sin necesidad de registrarte.
fr: Non. Nous privilégions l'accès instantané. Vous pouvez commencer à créer votre quiz dès votre arrivée sur notre page, sans inscription.
hi: नहीं। हम तत्काल पहुँच में विश्वास करते हैं। आप हमारे पेज पर आते ही अपनी क्विज़ बनाना शुरू कर सकते हैं, बिना साइन-अप के।

source: What topics can I create a quiz on?
es: ¿Sobre qué temas puedo crear un cuestionario?
fr: Sur quels sujets puis-je créer un quiz ?
hi: मैं किन विषयों पर क्विज़ बना सकता हूँ?

source: Any topic you can imagine! Our AI can generate a custom quiz on anything from Indian history and physics to Taylor Swift and the latest IPL season.
es: ¡Cualquier tema que imagines! Nuestra IA puede generar un cuestionario personalizado sobre cualquier tema, desde historia y física de la India hasta Taylor Swift y la última temporada de la IPL.
fr: Tous les sujets imaginables ! Notre IA peut générer un quiz personnalisé sur tous les sujets, de l'histoire et de la physique indiennes à Taylor Swift et la dernière saison de l'IPL.
hi: कोई भी विषय जिसकी आप कल्पना कर सकते हैं! हमारा AI भारतीय इतिहास और भौतिकी से लेकर टेलर स्विफ्ट और नवीनतम आईपीएल सीज़न तक, किसी भी विषय पर एक कस्टम क्विज़ तैयार कर सकता है।

source: What type of questions does it generate?
es: ¿Qué tipo de preguntas genera?
fr: Quels types de questions génère-t-il ?
hi: यह किस प्रकार के प्रश्न तैयार करता है?

source: QuizzSpark is a multiple-choice quiz maker. It automatically generates questions with four distinct options for each one.
es: QuizzSpark es un creador de cuestionarios de opción múltiple. Genera automáticamente preguntas con cuatro opciones distintas cada una.
fr: QuizzSpark est un créateur de quiz à choix multiples. Il génère automatiquement des questions avec quatre options distinctes pour chacune.
hi: QuizzSpark एक बहुविकल्पीय क्विज़ निर्माता है। यह प्रत्येक प्रश्न के लिए चार अलग-अलग विकल्पों के साथ स्वचालित रूप से प्रश्न तैयार करता है।

source: Who is this tool for?
es: ¿Para quién es esta herramienta?
fr: À qui s'adresse cet outil ?
hi: यह टूल किसके लिए है?

source: Our free online test creator is perfect for teachers making classroom assignments, students creating study guides, or anyone who wants to make a trivia quiz for fun.
es: Nuestro creador de cuestionarios en línea gratuito es perfecto para profesores que realizan tareas en clase, estudiantes que crean guías de estudio o cualquiera que quiera crear un cuestionario de trivia por diversión.
fr: Notre créateur de tests en ligne gratuit est idéal pour les enseignants qui préparent des devoirs, les élèves qui créent des guides de révision ou toute personne souhaitant créer un quiz ludique.
hi: हमारा मुफ़्त ऑनलाइन टेस्ट क्रिएटर कक्षा असाइनमेंट बनाने वाले शिक्षकों, अध्ययन मार्गदर्शिकाएँ बनाने वाले छात्रों, या मनोरंजन के लिए सामान्य ज्ञान क्विज़ बनाने वाले किसी भी व्यक्ति के लिए एकदम सही है।

source: QuizzSpark – Where curiosity meets its match.
es: QuizzSpark: Donde la curiosidad encuentra su punto fuerte.
fr: QuizzSpark – La curiosité à l’honneur.
hi: क्विज़स्पार्क - जहाँ जिज्ञासा और उसका मुकाबला होता है।

source: © 2025 QuizzSpark. All rights reserved. Happy quizzing!
es: © 2025 QuizzSpark. Todos los derechos reservados. ¡Que disfrutes de los cuestionarios!
fr: © 2025 QuizzSpark. Tous droits réservés. Bon quiz !
hi: © 2025 क्विज़स्पार्क। सर्वाधिकार सुरक्षित। क्विज़ खेलने का आनंद लें!
